//#ОБЯСНЕНИЕ НА ЗАДАЧАТА:

// Да се реализира функция, която проверява дали
// подреждането на байтовете в Union се извършва в Little Endian или Big Endian

#include <iostream>

bool isLittleEndian()
{
	union endiannessTest
	{
		uint32_t n = 1; 
		unsigned char bytes[4];

	} myTest;

	//сега има два слуая:
	//байтовете на [n] имат вида [0...00] [0...00] [0...00] [0...01]

	//ако работим в Little Endian, то ще запазваме стойностите в масива [bytes],
	//като ПОСЛЕДНИЯТ байт на [n] отговаря за първата клетка на масива,
	//(предпоследният за втората и т.н.)

	//ако работим в Big Endian, то ще запазваме стойностите в масива [bytes],
	//като ПЪРВИЯТ байт на [n] отговаря за първата клетка на масива
	//(вторият за втората и т.н.)

	//тъй като [n] е едно, т.е. последният байт на [n] не е само от нули,
	//ако първата клетка на [bytes] е 1 (тъй като последният байт на [n] отговаря на единица),
	//то работим в Little Endian, ако първата клетка отговаря на 0 - в Big Endian
	return myTest.bytes[0];
}

int main()
{

	std::cout << isLittleEndian() << std::endl;

	return 0;
}