//#ОБЯСНЕНИЕ НА ЗАДАЧАТА
// 
//Да се създаде клас Censore.
//Класът получава функция от по - висок ред със следната декларациа bool (*)(char).
//Ако функцията върне истина то символа трябва да бъде цензуриран.
//
//Предефинирайте operator<< така, че да приема низ и да попълва потока 
//със същия низ, но с цензурирани символи.
#include <iostream>
#include "Censore.h"

using namespace std;

int main()
{
    Censore c([](char ch) -> bool { return ch >= 'a' && ch <= 'z'; }, std::cout);
    c << "Hello" << ", WorLd";


}